Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactSpacing.Element Constructor
 Initializes a new instance of the RebarSpacing.ExactSpacing.Element struct.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Element(
	int number,
	double distance
)
Public Sub New (
	number As Integer,
	distance As Double
)
Parameters
number
Type: System.Int32
The number of spaces.
distance
Type: System.Double
The spacing distance.
See Also
Reference
RebarSpacing.ExactSpacing.Element Structure
Tekla.Structures.Model Namespace